app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_hash", "password_salt", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    # creates a new instance of User class
    @user = User.new(params[:user])

    # Attempts to save, if the validations checks the instance is saved
    # and the the application redirects to the root path
    if @user.save